<!-- tf-plan-dev -->
### :construction: Terraform Plan — `dev`

**+1** to add, **~0** to change, **-0** to destroy

| Status | Module | Summary |
|--------|--------|---------|
| :construction: | `resource-group` | +1 ~0 -0 |
| :grey_question: | `monitoring` | Plan completed |
| :grey_question: | `database` | Plan completed |
| :grey_question: | `storage` | Plan completed |
| :grey_question: | `container-registry` | Plan completed |
| :grey_question: | `container-apps` | Plan completed |

<details>
<summary>Full plan output</summary>

```
01:30:53.888 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./resource-group

Group 2
- Module ./container-registry
- Module ./database
- Module ./monitoring
- Module ./static-web-app-docs
- Module ./storage

Group 3
- Module ./container-apps


01:30:54.057 INFO   [resource-group] Downloading Terraform configurations from ../../../terraform/modules/resource-group into ./resource-group/.terragrunt-cache/OzQu53i4N-M4YvaSDvv9mD-V6BA/91YhilwHVY0vmuuWkvkfl2QktcE
01:30:54.082 STDOUT [resource-group] terraform: Initializing the backend...
01:30:55.289 STDOUT [resource-group] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
01:30:55.289 STDOUT [resource-group] terraform: use this backend unless the backend configuration changes.
01:30:56.582 STDOUT [resource-group] terraform: Initializing provider plugins...
01:30:56.582 STDOUT [resource-group] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
01:30:56.655 STDOUT [resource-group] terraform: - Finding latest version of hashicorp/azuread...
01:30:56.852 STDOUT [resource-group] terraform: - Installing hashicorp/azurerm v4.62.1...
01:30:58.544 STDOUT [resource-group] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
01:30:58.692 STDOUT [resource-group] terraform: - Installing hashicorp/azuread v3.8.0...
01:30:59.189 STDOUT [resource-group] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
01:30:59.189 STDOUT [resource-group] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:30:59.189 STDOUT [resource-group] terraform: selections it made above. Include this file in your version control repository
01:30:59.189 STDOUT [resource-group] terraform: so that Terraform can guarantee to make the same selections by default when
01:30:59.189 STDOUT [resource-group] terraform: you run "terraform init" in the future.
01:30:59.190 STDOUT [resource-group] terraform: Terraform has been successfully initialized!
01:30:59.190 STDOUT [resource-group] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:30:59.190 STDOUT [resource-group] terraform: any changes that are required for your infrastructure. All Terraform commands
01:30:59.190 STDOUT [resource-group] terraform: should now work.
01:30:59.190 STDOUT [resource-group] terraform: If you ever set or change modules or backend configuration for Terraform,
01:30:59.190 STDOUT [resource-group] terraform: rerun this command to reinitialize your working directory. If you forget, other
01:30:59.190 STDOUT [resource-group] terraform: commands will detect it and remind you to do so if necessary.
01:31:01.050 STDOUT [resource-group] terraform: Acquiring state lock. This may take a few moments...
01:31:09.246 STDOUT [resource-group] terraform: Terraform used the selected providers to generate the following execution
01:31:09.247 STDOUT [resource-group] terraform: plan. Resource actions are indicated with the following symbols:
01:31:09.247 STDOUT [resource-group] terraform:   + create
01:31:09.247 STDOUT [resource-group] terraform: Terraform will perform the following actions:
01:31:09.247 STDOUT [resource-group] terraform:   # azurerm_resource_group.main will be created
01:31:09.247 STDOUT [resource-group] terraform:   + resource "azurerm_resource_group" "main" {
01:31:09.247 STDOUT [resource-group] terraform:       + id       = (known after apply)
01:31:09.247 STDOUT [resource-group] terraform:       + location = "southafricanorth"
01:31:09.247 STDOUT [resource-group] terraform:       + name     = "rg-chaufher-dev"
01:31:09.247 STDOUT [resource-group] terraform:       + tags     = {
01:31:09.247 STDOUT [resource-group] terraform:           + "costCenter"  = "development"
01:31:09.247 STDOUT [resource-group] terraform:           + "environment" = "dev"
01:31:09.247 STDOUT [resource-group] terraform:           + "managedBy"   = "Terragrunt"
01:31:09.247 STDOUT [resource-group] terraform:           + "org"         = "chf"
01:31:09.247 STDOUT [resource-group] terraform:           + "project"     = "ChaufHER"
01:31:09.247 STDOUT [resource-group] terraform:         }
01:31:09.247 STDOUT [resource-group] terraform:     }
01:31:09.247 STDOUT [resource-group] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
01:31:09.247 STDOUT [resource-group] terraform: Changes to Outputs:
01:31:09.247 STDOUT [resource-group] terraform:   + id       = (known after apply)
01:31:09.247 STDOUT [resource-group] terraform:   + location = "southafricanorth"
01:31:09.247 STDOUT [resource-group] terraform:   + name     = "rg-chaufher-dev"
01:31:09.247 STDOUT [resource-group] terraform: ─────────────────────────────────────────────────────────────────────────────
01:31:09.248 STDOUT [resource-group] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
01:31:09.248 STDOUT [resource-group] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
01:31:09.647 STDOUT [resource-group] terraform: Releasing state lock. This may take a few moments...
01:31:12.402 WARN   [static-web-app-docs] Config ./resource-group/terragrunt.hcl is a dependency of ./static-web-app-docs/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
01:31:12.403 WARN   [database] Config ./resource-group/terragrunt.hcl is a dependency of ./database/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
01:31:12.403 WARN   [container-registry] Config ./resource-group/terragrunt.hcl is a dependency of ./container-registry/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
01:31:12.403 WARN   [storage] Config ./resource-group/terragrunt.hcl is a dependency of ./storage/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
01:31:12.403 WARN   [monitoring] Config ./resource-group/terragrunt.hcl is a dependency of ./monitoring/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
01:31:12.415 INFO   [database] Downloading Terraform configurations from ../../../terraform/modules/database into ./database/.terragrunt-cache/h-uJ1jgwVNngcLdJ7Ke5cUGN6bI/IxRQpDSJ16yiruksTsU6PnHregM
01:31:12.419 INFO   [container-registry] Downloading Terraform configurations from ../../../terraform/modules/container-registry into ./container-registry/.terragrunt-cache/R_UA_j69Por7aWgzVLvmr7NUvlQ/6dP-ebFu_ykPPzxiW9Hwgqygzd4
01:31:12.420 INFO   [static-web-app-docs] Downloading Terraform configurations from ../../../terraform/modules/static-web-app into ./static-web-app-docs/.terragrunt-cache/iK31mpe0oFfS9aZUi7TwR9FC30w/Vox_oPeYAHk-WOfmjaaUzzoIGdI
01:31:12.424 INFO   [monitoring] Downloading Terraform configurations from ../../../terraform/modules/monitoring into ./monitoring/.terragrunt-cache/FbrpJTM_DdK9nblAYnl366gVoPU/Ys1SlQ6tJBYiPrgardGFs0q0yWM
01:31:12.425 INFO   [storage] Downloading Terraform configurations from ../../../terraform/modules/storage into ./storage/.terragrunt-cache/wGL2TaUztOPJSuKoIi_r4RFlkvM/FE7Eqfe2vdjB4Va9-rcOBZDAfIQ
01:31:12.469 STDOUT [static-web-app-docs] terraform: Initializing the backend...
01:31:12.476 STDOUT [container-registry] terraform: Initializing the backend...
01:31:12.484 STDOUT [database] terraform: Initializing the backend...
01:31:12.484 STDOUT [storage] terraform: Initializing the backend...
01:31:12.505 STDOUT [monitoring] terraform: Initializing the backend...
01:31:13.673 STDOUT [static-web-app-docs] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
01:31:13.673 STDOUT [static-web-app-docs] terraform: use this backend unless the backend configuration changes.
01:31:13.695 STDOUT [container-registry] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
01:31:13.695 STDOUT [container-registry] terraform: use this backend unless the backend configuration changes.
01:31:13.722 STDOUT [storage] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
01:31:13.722 STDOUT [storage] terraform: use this backend unless the backend configuration changes.
01:31:13.961 STDOUT [monitoring] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
01:31:13.961 STDOUT [monitoring] terraform: use this backend unless the backend configuration changes.
01:31:13.974 STDOUT [database] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
01:31:13.974 STDOUT [database] terraform: use this backend unless the backend configuration changes.
01:31:14.970 STDOUT [container-registry] terraform: Initializing provider plugins...
01:31:14.970 STDOUT [container-registry] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
01:31:14.983 STDOUT [storage] terraform: Initializing provider plugins...
01:31:14.983 STDOUT [storage] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
01:31:15.047 STDOUT [container-registry] terraform: - Finding latest version of hashicorp/azuread...
01:31:15.068 STDOUT [storage] terraform: - Finding latest version of hashicorp/azuread...
01:31:15.211 STDOUT [container-registry] terraform: - Installing hashicorp/azuread v3.8.0...
01:31:15.220 STDOUT [monitoring] terraform: Initializing provider plugins...
01:31:15.220 STDOUT [monitoring] terraform: - Finding latest version of hashicorp/azuread...
01:31:15.232 STDOUT [database] terraform: Initializing provider plugins...
01:31:15.232 STDOUT [database] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
01:31:15.248 STDOUT [storage] terraform: - Installing hashicorp/azuread v3.8.0...
01:31:15.294 STDOUT [monitoring] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
01:31:15.309 STDOUT [database] terraform: - Finding latest version of hashicorp/azuread...
01:31:15.457 STDOUT [monitoring] terraform: - Installing hashicorp/azuread v3.8.0...
01:31:15.481 STDOUT [database] terraform: - Installing hashicorp/azurerm v4.62.1...
01:31:15.890 STDOUT [storage] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
01:31:15.892 STDOUT [container-registry] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
01:31:16.021 STDOUT [container-registry] terraform: - Installing hashicorp/azurerm v4.62.1...
01:31:16.030 STDOUT [storage] terraform: - Installing hashicorp/azurerm v4.62.1...
01:31:16.099 STDOUT [monitoring] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
01:31:16.248 STDOUT [monitoring] terraform: - Installing hashicorp/azurerm v4.62.1...
01:31:17.790 STDOUT [database] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
01:31:17.925 STDOUT [database] terraform: - Installing hashicorp/azuread v3.8.0...
01:31:18.183 STDOUT [static-web-app-docs] terraform: Initializing provider plugins...
01:31:18.183 STDOUT [static-web-app-docs] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
01:31:18.279 STDOUT [static-web-app-docs] terraform: - Finding latest version of hashicorp/azuread...
01:31:18.402 STDOUT [container-registry] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
01:31:18.402 STDOUT [container-registry] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:31:18.402 STDOUT [container-registry] terraform: selections it made above. Include this file in your version control repository
01:31:18.402 STDOUT [container-registry] terraform: so that Terraform can guarantee to make the same selections by default when
01:31:18.402 STDOUT [container-registry] terraform: you run "terraform init" in the future.
01:31:18.403 STDOUT [container-registry] terraform: Terraform has been successfully initialized!
01:31:18.403 STDOUT [container-registry] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:31:18.403 STDOUT [container-registry] terraform: any changes that are required for your infrastructure. All Terraform commands
01:31:18.403 STDOUT [container-registry] terraform: should now work.
01:31:18.403 STDOUT [container-registry] terraform: If you ever set or change modules or backend configuration for Terraform,
01:31:18.403 STDOUT [container-registry] terraform: rerun this command to reinitialize your working directory. If you forget, other
01:31:18.403 STDOUT [container-registry] terraform: commands will detect it and remind you to do so if necessary.
01:31:18.430 STDOUT [storage] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
01:31:18.430 STDOUT [storage] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:31:18.430 STDOUT [storage] terraform: selections it made above. Include this file in your version control repository
01:31:18.430 STDOUT [storage] terraform: so that Terraform can guarantee to make the same selections by default when
01:31:18.430 STDOUT [storage] terraform: you run "terraform init" in the future.
01:31:18.430 STDOUT [storage] terraform: Terraform has been successfully initialized!
01:31:18.431 STDOUT [storage] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:31:18.431 STDOUT [storage] terraform: any changes that are required for your infrastructure. All Terraform commands
01:31:18.431 STDOUT [storage] terraform: should now work.
01:31:18.431 STDOUT [storage] terraform: If you ever set or change modules or backend configuration for Terraform,
01:31:18.431 STDOUT [storage] terraform: rerun this command to reinitialize your working directory. If you forget, other
01:31:18.431 STDOUT [storage] terraform: commands will detect it and remind you to do so if necessary.
01:31:18.470 STDOUT [static-web-app-docs] terraform: - Installing hashicorp/azurerm v4.62.1...
01:31:18.660 STDOUT [monitoring] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
01:31:18.662 STDOUT [monitoring] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:31:18.662 STDOUT [monitoring] terraform: selections it made above. Include this file in your version control repository
01:31:18.662 STDOUT [monitoring] terraform: so that Terraform can guarantee to make the same selections by default when
01:31:18.663 STDOUT [monitoring] terraform: you run "terraform init" in the future.
01:31:18.663 STDOUT [monitoring] terraform: Terraform has been successfully initialized!
01:31:18.663 STDOUT [monitoring] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:31:18.664 STDOUT [monitoring] terraform: any changes that are required for your infrastructure. All Terraform commands
01:31:18.664 STDOUT [monitoring] terraform: should now work.
01:31:18.664 STDOUT [monitoring] terraform: If you ever set or change modules or backend configuration for Terraform,
01:31:18.665 STDOUT [monitoring] terraform: rerun this command to reinitialize your working directory. If you forget, other
01:31:18.665 STDOUT [monitoring] terraform: commands will detect it and remind you to do so if necessary.
01:31:18.727 STDOUT [database] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
01:31:18.727 STDOUT [database] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:31:18.727 STDOUT [database] terraform: selections it made above. Include this file in your version control repository
01:31:18.727 STDOUT [database] terraform: so that Terraform can guarantee to make the same selections by default when
01:31:18.727 STDOUT [database] terraform: you run "terraform init" in the future.
01:31:18.727 STDOUT [database] terraform: Terraform has been successfully initialized!
01:31:18.727 STDOUT [database] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:31:18.727 STDOUT [database] terraform: any changes that are required for your infrastructure. All Terraform commands
01:31:18.727 STDOUT [database] terraform: should now work.
01:31:18.727 STDOUT [database] terraform: If you ever set or change modules or backend configuration for Terraform,
01:31:18.727 STDOUT [database] terraform: rerun this command to reinitialize your working directory. If you forget, other
01:31:18.727 STDOUT [database] terraform: commands will detect it and remind you to do so if necessary.
01:31:20.251 STDOUT [static-web-app-docs] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
01:31:20.379 STDOUT [static-web-app-docs] terraform: - Installing hashicorp/azuread v3.8.0...
01:31:20.399 STDOUT [storage] terraform: Acquiring state lock. This may take a few moments...
01:31:20.579 STDOUT [monitoring] terraform: Acquiring state lock. This may take a few moments...
01:31:20.664 STDOUT [container-registry] terraform: Acquiring state lock. This may take a few moments...
01:31:20.851 STDOUT [database] terraform: Acquiring state lock. This may take a few moments...
01:31:20.941 STDOUT [static-web-app-docs] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
01:31:20.941 STDOUT [static-web-app-docs] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:31:20.941 STDOUT [static-web-app-docs] terraform: selections it made above. Include this file in your version control repository
01:31:20.941 STDOUT [static-web-app-docs] terraform: so that Terraform can guarantee to make the same selections by default when
01:31:20.941 STDOUT [static-web-app-docs] terraform: you run "terraform init" in the future.
01:31:20.941 STDOUT [static-web-app-docs] terraform: Terraform has been successfully initialized!
01:31:20.941 STDOUT [static-web-app-docs] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:31:20.941 STDOUT [static-web-app-docs] terraform: any changes that are required for your infrastructure. All Terraform commands
01:31:20.942 STDOUT [static-web-app-docs] terraform: should now work.
01:31:20.942 STDOUT [static-web-app-docs] terraform: If you ever set or change modules or backend configuration for Terraform,
01:31:20.942 STDOUT [static-web-app-docs] terraform: rerun this command to reinitialize your working directory. If you forget, other
01:31:20.942 STDOUT [static-web-app-docs] terraform: commands will detect it and remind you to do so if necessary.
01:31:23.054 STDOUT [static-web-app-docs] terraform: Acquiring state lock. This may take a few moments...
01:31:26.557 STDOUT [monitoring] terraform: Terraform used the selected providers to generate the following execution
01:31:26.557 STDOUT [monitoring] terraform: plan. Resource actions are indicated with the following symbols:
01:31:26.557 STDOUT [monitoring] terraform:   + create
01:31:26.557 STDOUT [monitoring] terraform: Terraform will perform the following actions:
01:31:26.557 STDOUT [monitoring] terraform:   # azurerm_application_insights.main will be created
01:31:26.557 STDOUT [monitoring] terraform:   + resource "azurerm_application_insights" "main" {
01:31:26.557 STDOUT [monitoring] terraform:       + app_id                              = (known after apply)
01:31:26.557 STDOUT [monitoring] terraform:       + application_type                    = "web"
01:31:26.557 STDOUT [monitoring] terraform:       + connection_string                   = (sensitive value)
01:31:26.557 STDOUT [monitoring] terraform:       + daily_data_cap_in_gb                = 100
01:31:26.558 STDOUT [monitoring] terraform:       + disable_ip_masking                  = false
01:31:26.558 STDOUT [monitoring] terraform:       + force_customer_storage_for_profiler = false
01:31:26.558 STDOUT [monitoring] terraform:       + id                                  = (known after apply)
01:31:26.558 STDOUT [monitoring] terraform:       + instrumentation_key                 = (sensitive value)
01:31:26.558 STDOUT [monitoring] terraform:       + internet_ingestion_enabled          = true
01:31:26.558 STDOUT [monitoring] terraform:       + internet_query_enabled              = true
01:31:26.558 STDOUT [monitoring] terraform:       + local_authentication_disabled       = false
01:31:26.558 STDOUT [monitoring] terraform:       + location                            = "southafricanorth"
01:31:26.558 STDOUT [monitoring] terraform:       + name                                = "chf-dev-insights-dev"
01:31:26.558 STDOUT [monitoring] terraform:       + resource_group_name                 = "rg-mock"
01:31:26.558 STDOUT [monitoring] terraform:       + retention_in_days                   = 90
01:31:26.558 STDOUT [monitoring] terraform:       + sampling_percentage                 = 100
01:31:26.558 STDOUT [monitoring] terraform:       + tags                                = {
01:31:26.558 STDOUT [monitoring] terraform:           + "costCenter"  = "development"
01:31:26.558 STDOUT [monitoring] terraform:           + "environment" = "dev"
01:31:26.558 STDOUT [monitoring] terraform:           + "managedBy"   = "Terragrunt"
01:31:26.558 STDOUT [monitoring] terraform:           + "org"         = "chf"
01:31:26.559 STDOUT [monitoring] terraform:           + "project"     = "ChaufHER"
01:31:26.559 STDOUT [monitoring] terraform:         }
01:31:26.559 STDOUT [monitoring] terraform:       + workspace_id                        = (known after apply)
01:31:26.559 STDOUT [monitoring] terraform:     }
01:31:26.559 STDOUT [monitoring] terraform:   # azurerm_log_analytics_workspace.main will be created
01:31:26.559 STDOUT [monitoring] terraform:   + resource "azurerm_log_analytics_workspace" "main" {
01:31:26.559 STDOUT [monitoring] terraform:       + allow_resource_only_permissions = true
01:31:26.559 STDOUT [monitoring] terraform:       + daily_quota_gb                  = -1
01:31:26.559 STDOUT [monitoring] terraform:       + id                              = (known after apply)
01:31:26.559 STDOUT [monitoring] terraform:       + internet_ingestion_enabled      = true
01:31:26.559 STDOUT [monitoring] terraform:       + internet_query_enabled          = true
01:31:26.559 STDOUT [monitoring] terraform:       + local_authentication_disabled   = (known after apply)
01:31:26.559 STDOUT [monitoring] terraform:       + local_authentication_enabled    = (known after apply)
01:31:26.559 STDOUT [monitoring] terraform:       + location                        = "southafricanorth"
01:31:26.559 STDOUT [monitoring] terraform:       + name                            = "chf-dev-logs-dev"
01:31:26.559 STDOUT [monitoring] terraform:       + primary_shared_key              = (sensitive value)
01:31:26.559 STDOUT [monitoring] terraform:       + resource_group_name             = "rg-mock"
01:31:26.560 STDOUT [monitoring] terraform:       + retention_in_days               = 30
01:31:26.560 STDOUT [monitoring] terraform:       + secondary_shared_key            = (sensitive value)
01:31:26.560 STDOUT [monitoring] terraform:       + sku                             = "PerGB2018"
01:31:26.560 STDOUT [monitoring] terraform:       + tags                            = {
01:31:26.560 STDOUT [monitoring] terraform:           + "costCenter"  = "development"
01:31:26.560 STDOUT [monitoring] terraform:           + "environment" = "dev"
01:31:26.560 STDOUT [monitoring] terraform:           + "managedBy"   = "Terragrunt"
01:31:26.560 STDOUT [monitoring] terraform:           + "org"         = "chf"
01:31:26.560 STDOUT [monitoring] terraform:           + "project"     = "ChaufHER"
01:31:26.560 STDOUT [monitoring] terraform:         }
01:31:26.560 STDOUT [monitoring] terraform:       + workspace_id                    = (known after apply)
01:31:26.560 STDOUT [monitoring] terraform:     }
01:31:26.560 STDOUT [monitoring] terraform: Plan: 2 to add, 0 to change, 0 to destroy.
01:31:26.560 STDOUT [monitoring] terraform: Changes to Outputs:
01:31:26.560 STDOUT [monitoring] terraform:   + app_insights_connection_string             = (sensitive value)
01:31:26.560 STDOUT [monitoring] terraform:   + app_insights_instrumentation_key           = (sensitive value)
01:31:26.560 STDOUT [monitoring] terraform:   + log_analytics_workspace_customer_id        = (known after apply)
01:31:26.560 STDOUT [monitoring] terraform:   + log_analytics_workspace_id                 = (known after apply)
01:31:26.561 STDOUT [monitoring] terraform:   + log_analytics_workspace_primary_shared_key = (sensitive value)
01:31:26.561 STDOUT [monitoring] terraform: ─────────────────────────────────────────────────────────────────────────────
01:31:26.561 STDOUT [monitoring] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
01:31:26.561 STDOUT [monitoring] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
01:31:26.958 STDOUT [monitoring] terraform: Releasing state lock. This may take a few moments...
01:31:29.523 STDOUT [database] terraform: Terraform used the selected providers to generate the following execution
01:31:29.523 STDOUT [database] terraform: plan. Resource actions are indicated with the following symbols:
01:31:29.523 STDOUT [database] terraform:   + create
01:31:29.523 STDOUT [database] terraform: Terraform will perform the following actions:
01:31:29.523 STDOUT [database] terraform:   # azurerm_mssql_database.main will be created
01:31:29.523 STDOUT [database] terraform:   + resource "azurerm_mssql_database" "main" {
01:31:29.523 STDOUT [database] terraform:       + auto_pause_delay_in_minutes                                = (known after apply)
01:31:29.523 STDOUT [database] terraform:       + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
01:31:29.523 STDOUT [database] terraform:       + create_mode                                                = "Default"
01:31:29.523 STDOUT [database] terraform:       + creation_source_database_id                                = (known after apply)
01:31:29.523 STDOUT [database] terraform:       + enclave_type                                               = (known after apply)
01:31:29.524 STDOUT [database] terraform:       + geo_backup_enabled                                         = true
01:31:29.524 STDOUT [database] terraform:       + id                                                         = (known after apply)
01:31:29.524 STDOUT [database] terraform:       + ledger_enabled                                             = false
01:31:29.524 STDOUT [database] terraform:       + license_type                                               = (known after apply)
01:31:29.524 STDOUT [database] terraform:       + maintenance_configuration_name                             = (known after apply)
01:31:29.524 STDOUT [database] terraform:       + max_size_gb                                                = 250
01:31:29.524 STDOUT [database] terraform:       + min_capacity                                               = (known after apply)
01:31:29.524 STDOUT [database] terraform:       + name                                                       = "chf-dev-db-dev"
01:31:29.524 STDOUT [database] terraform:       + read_replica_count                                         = (known after apply)
01:31:29.524 STDOUT [database] terraform:       + read_scale                                                 = (known after apply)
01:31:29.525 STDOUT [database] terraform:       + restore_point_in_time                                      = (known after apply)
01:31:29.525 STDOUT [database] terraform:       + sample_name                                                = (known after apply)
01:31:29.525 STDOUT [database] terraform:       + secondary_type                                             = (known after apply)
01:31:29.525 STDOUT [database] terraform:       + server_id                                                  = (known after apply)
01:31:29.525 STDOUT [database] terraform:       + sku_name                                                   = "S0"
01:31:29.525 STDOUT [database] terraform:       + storage_account_type                                       = "Geo"
01:31:29.525 STDOUT [database] terraform:       + tags                                                       = {
01:31:29.525 STDOUT [database] terraform:           + "costCenter"  = "development"
01:31:29.525 STDOUT [database] terraform:           + "environment" = "dev"
01:31:29.525 STDOUT [database] terraform:           + "managedBy"   = "Terragrunt"
01:31:29.525 STDOUT [database] terraform:           + "org"         = "chf"
01:31:29.525 STDOUT [database] terraform:           + "project"     = "ChaufHER"
01:31:29.525 STDOUT [database] terraform:         }
01:31:29.525 STDOUT [database] terraform:       + transparent_data_encryption_enabled                        = true
01:31:29.526 STDOUT [database] terraform:       + transparent_data_encryption_key_automatic_rotation_enabled = false
01:31:29.526 STDOUT [database] terraform:       + zone_redundant                                             = false
01:31:29.526 STDOUT [database] terraform:       + long_term_retention_policy (known after apply)
01:31:29.526 STDOUT [database] terraform:       + short_term_retention_policy (known after apply)
01:31:29.526 STDOUT [database] terraform:       + threat_detection_policy (known after apply)
01:31:29.526 STDOUT [database] terraform:     }
01:31:29.526 STDOUT [database] terraform:   # azurerm_mssql_server.main will be created
01:31:29.526 STDOUT [database] terraform:   + resource "azurerm_mssql_server" "main" {
01:31:29.526 STDOUT [database] terraform:       + administrator_login                      = "chaufheradmin"
01:31:29.526 STDOUT [database] terraform:       + connection_policy                        = "Default"
01:31:29.526 STDOUT [database] terraform:       + express_vulnerability_assessment_enabled = false
01:31:29.526 STDOUT [database] terraform:       + fully_qualified_domain_name              = (known after apply)
01:31:29.526 STDOUT [database] terraform:       + id                                       = (known after apply)
01:31:29.526 STDOUT [database] terraform:       + location                                 = "southafricanorth"
01:31:29.526 STDOUT [database] terraform:       + minimum_tls_version                      = "1.2"
01:31:29.526 STDOUT [database] terraform:       + name                                     = "chf-dev-sql-dev"
01:31:29.527 STDOUT [database] terraform:       + outbound_network_restriction_enabled     = false
01:31:29.527 STDOUT [database] terraform:       + primary_user_assigned_identity_id        = (known after apply)
01:31:29.527 STDOUT [database] terraform:       + public_network_access_enabled            = false
01:31:29.527 STDOUT [database] terraform:       + resource_group_name                      = "rg-mock"
01:31:29.527 STDOUT [database] terraform:       + restorable_dropped_database_ids          = (known after apply)
01:31:29.527 STDOUT [database] terraform:       + tags                                     = {
01:31:29.527 STDOUT [database] terraform:           + "costCenter"  = "development"
01:31:29.527 STDOUT [database] terraform:           + "environment" = "dev"
01:31:29.527 STDOUT [database] terraform:           + "managedBy"   = "Terragrunt"
01:31:29.527 STDOUT [database] terraform:           + "org"         = "chf"
01:31:29.527 STDOUT [database] terraform:           + "project"     = "ChaufHER"
01:31:29.527 STDOUT [database] terraform:         }
01:31:29.527 STDOUT [database] terraform:       + version                                  = "12.0"
01:31:29.527 STDOUT [database] terraform:         # (1 unchanged attribute hidden)
01:31:29.527 STDOUT [database] terraform:     }
01:31:29.527 STDOUT [database] terraform:   # azurerm_redis_cache.main will be created
01:31:29.527 STDOUT [database] terraform:   + resource "azurerm_redis_cache" "main" {
01:31:29.527 STDOUT [database] terraform:       + access_keys_authentication_enabled = true
01:31:29.527 STDOUT [database] terraform:       + capacity                           = 0
01:31:29.528 STDOUT [database] terraform:       + family                             = "C"
01:31:29.528 STDOUT [database] terraform:       + hostname                           = (known after apply)
01:31:29.528 STDOUT [database] terraform:       + id                                 = (known after apply)
01:31:29.528 STDOUT [database] terraform:       + location                           = "southafricanorth"
01:31:29.528 STDOUT [database] terraform:       + minimum_tls_version                = "1.2"
01:31:29.528 STDOUT [database] terraform:       + name                               = "chf-dev-redis-dev"
01:31:29.528 STDOUT [database] terraform:       + non_ssl_port_enabled               = false
01:31:29.528 STDOUT [database] terraform:       + port                               = (known after apply)
01:31:29.528 STDOUT [database] terraform:       + primary_access_key                 = (sensitive value)
01:31:29.528 STDOUT [database] terraform:       + primary_connection_string          = (sensitive value)
01:31:29.528 STDOUT [database] terraform:       + private_static_ip_address          = (known after apply)
01:31:29.528 STDOUT [database] terraform:       + public_network_access_enabled      = false
01:31:29.528 STDOUT [database] terraform:       + redis_version                      = "6"
01:31:29.528 STDOUT [database] terraform:       + replicas_per_master                = (known after apply)
01:31:29.528 STDOUT [database] terraform:       + replicas_per_primary               = (known after apply)
01:31:29.529 STDOUT [database] terraform:       + resource_group_name                = "rg-mock"
01:31:29.529 STDOUT [database] terraform:       + secondary_access_key               = (sensitive value)
01:31:29.529 STDOUT [database] terraform:       + secondary_connection_string        = (sensitive value)
01:31:29.529 STDOUT [database] terraform:       + sku_name                           = "Basic"
01:31:29.529 STDOUT [database] terraform:       + ssl_port                           = (known after apply)
01:31:29.529 STDOUT [database] terraform:       + tags                               = {
01:31:29.529 STDOUT [database] terraform:           + "costCenter"  = "development"
01:31:29.529 STDOUT [database] terraform:           + "environment" = "dev"
01:31:29.529 STDOUT [database] terraform:           + "managedBy"   = "Terragrunt"
01:31:29.529 STDOUT [database] terraform:           + "org"         = "chf"
01:31:29.529 STDOUT [database] terraform:           + "project"     = "ChaufHER"
01:31:29.529 STDOUT [database] terraform:         }
01:31:29.529 STDOUT [database] terraform:       + redis_configuration {
01:31:29.529 STDOUT [database] terraform:           + aof_backup_enabled              = false
01:31:29.529 STDOUT [database] terraform:           + authentication_enabled          = true
01:31:29.529 STDOUT [database] terraform:           + maxclients                      = (known after apply)
01:31:29.529 STDOUT [database] terraform:           + maxfragmentationmemory_reserved = (known after apply)
01:31:29.529 STDOUT [database] terraform:           + maxmemory_delta                 = (known after apply)
01:31:29.530 STDOUT [database] terraform:           + maxmemory_policy                = "volatile-lru"
01:31:29.530 STDOUT [database] terraform:           + maxmemory_reserved              = (known after apply)
01:31:29.530 STDOUT [database] terraform:         }
01:31:29.530 STDOUT [database] terraform:     }
01:31:29.530 STDOUT [database] terraform: Plan: 3 to add, 0 to change, 0 to destroy.
01:31:29.530 STDOUT [database] terraform: Changes to Outputs:
01:31:29.530 STDOUT [database] terraform:   + redis_connection_string  = (sensitive value)
01:31:29.530 STDOUT [database] terraform:   + redis_hostname           = (known after apply)
01:31:29.530 STDOUT [database] terraform:   + redis_primary_access_key = (sensitive value)
01:31:29.530 STDOUT [database] terraform:   + redis_ssl_port           = (known after apply)
01:31:29.530 STDOUT [database] terraform:   + sql_connection_string    = (known after apply)
01:31:29.530 STDOUT [database] terraform:   + sql_database_name        = "chf-dev-db-dev"
01:31:29.530 STDOUT [database] terraform:   + sql_server_fqdn          = (known after apply)
01:31:29.530 STDOUT [database] terraform:   + sql_server_id            = (known after apply)
01:31:29.530 STDOUT [database] terraform: ─────────────────────────────────────────────────────────────────────────────
01:31:29.530 STDOUT [database] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
01:31:29.530 STDOUT [database] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
01:31:29.924 STDOUT [database] terraform: Releasing state lock. This may take a few moments...
01:31:30.127 STDOUT [storage] terraform: Terraform used the selected providers to generate the following execution
01:31:30.127 STDOUT [storage] terraform: plan. Resource actions are indicated with the following symbols:
01:31:30.127 STDOUT [storage] terraform:   + create
01:31:30.127 STDOUT [storage] terraform: Terraform will perform the following actions:
01:31:30.128 STDOUT [storage] terraform:   # azurerm_storage_account.main will be created
01:31:30.128 STDOUT [storage] terraform:   + resource "azurerm_storage_account" "main" {
01:31:30.128 STDOUT [storage] terraform:       + access_tier                        = "Hot"
01:31:30.128 STDOUT [storage] terraform:       + account_kind                       = "StorageV2"
01:31:30.128 STDOUT [storage] terraform:       + account_replication_type           = "LRS"
01:31:30.128 STDOUT [storage] terraform:       + account_tier                       = "Standard"
01:31:30.128 STDOUT [storage] terraform:       + allow_nested_items_to_be_public    = false
01:31:30.128 STDOUT [storage] terraform:       + cross_tenant_replication_enabled   = false
01:31:30.128 STDOUT [storage] terraform:       + default_to_oauth_authentication    = false
01:31:30.128 STDOUT [storage] terraform:       + dns_endpoint_type                  = "Standard"
01:31:30.128 STDOUT [storage] terraform:       + https_traffic_only_enabled         = true
01:31:30.128 STDOUT [storage] terraform:       + id                                 = (known after apply)
01:31:30.128 STDOUT [storage] terraform:       + infrastructure_encryption_enabled  = true
01:31:30.128 STDOUT [storage] terraform:       + is_hns_enabled                     = false
01:31:30.128 STDOUT [storage] terraform:       + large_file_share_enabled           = (known after apply)
01:31:30.128 STDOUT [storage] terraform:       + local_user_enabled                 = true
01:31:30.128 STDOUT [storage] terraform:       + location                           = "southafricanorth"
01:31:30.128 STDOUT [storage] terraform:       + min_tls_version                    = "TLS1_2"
01:31:30.129 STDOUT [storage] terraform:       + name                               = "chfdevstordev"
01:31:30.129 STDOUT [storage] terraform:       + nfsv3_enabled                      = false
01:31:30.129 STDOUT [storage] terraform:       + primary_access_key                 = (sensitive value)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_connection_string     = (sensitive value)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_endpoint              = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_host                  = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_internet_endpoint     = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_internet_host         = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_microsoft_endpoint    = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_blob_microsoft_host        = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_connection_string          = (sensitive value)
01:31:30.129 STDOUT [storage] terraform:       + primary_dfs_endpoint               = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_dfs_host                   = (known after apply)
01:31:30.129 STDOUT [storage] terraform:       + primary_dfs_internet_endpoint      = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_dfs_internet_host          = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_dfs_microsoft_endpoint     = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_dfs_microsoft_host         = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_file_endpoint              = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_file_host                  = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_file_internet_endpoint     = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_file_internet_host         = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_file_microsoft_endpoint    = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_file_microsoft_host        = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_location                   = (known after apply)
01:31:30.130 STDOUT [storage] terraform:       + primary_queue_endpoint             = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_queue_host                 = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_queue_microsoft_endpoint   = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_queue_microsoft_host       = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_table_endpoint             = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_table_host                 = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_table_microsoft_endpoint   = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_table_microsoft_host       = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_web_endpoint               = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_web_host                   = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_web_internet_endpoint      = (known after apply)
01:31:30.131 STDOUT [storage] terraform:       + primary_web_internet_host          = (known after apply)
01:31:30.132 STDOUT [storage] terraform:       + primary_web_microsoft_endpoint     = (known after apply)
01:31:30.132 STDOUT [storage] terraform:       + primary_web_microsoft_host         = (known after apply)
01:31:30.132 STDOUT [storage] terraform:       + public_network_access_enabled      = false
01:31:30.132 STDOUT [storage] terraform:       + queue_encryption_key_type          = "Service"
01:31:30.132 STDOUT [storage] terraform:       + resource_group_name                = "rg-mock"
01:31:30.132 STDOUT [storage] terraform:       + secondary_access_key               = (sensitive value)
01:31:30.132 STDOUT [storage] terraform:       + secondary_blob_connection_string   = (sensitive value)
01:31:30.132 STDOUT [storage] terraform:       + secondary_blob_endpoint            = (known after apply)
01:31:30.132 STDOUT [storage] terraform:       + secondary_blob_host                = (known after apply)
01:31:30.132 STDOUT [storage] terraform:       + secondary_blob_internet_endpoint   = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_blob_internet_host       = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_blob_microsoft_endpoint  = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_blob_microsoft_host      = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_connection_string        = (sensitive value)
01:31:30.133 STDOUT [storage] terraform:       + secondary_dfs_endpoint             = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_dfs_host                 = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_dfs_internet_endpoint    = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_dfs_internet_host        = (known after apply)
01:31:30.133 STDOUT [storage] terraform:       + secondary_dfs_microsoft_endpoint   = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_dfs_microsoft_host       = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_file_endpoint            = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_file_host                = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_file_internet_endpoint   = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_file_internet_host       = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_file_microsoft_endpoint  = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_file_microsoft_host      = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_location                 = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_queue_endpoint           = (known after apply)
01:31:30.134 STDOUT [storage] terraform:       + secondary_queue_host               = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_queue_microsoft_endpoint = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_queue_microsoft_host     = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_table_endpoint           = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_table_host               = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_table_microsoft_endpoint = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_table_microsoft_host     = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_web_endpoint             = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_web_host                 = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_web_internet_endpoint    = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_web_internet_host        = (known after apply)
01:31:30.135 STDOUT [storage] terraform:       + secondary_web_microsoft_endpoint   = (known after apply)
01:31:30.136 STDOUT [storage] terraform:       + secondary_web_microsoft_host       = (known after apply)
01:31:30.136 STDOUT [storage] terraform:       + sftp_enabled                       = false
01:31:30.136 STDOUT [storage] terraform:       + shared_access_key_enabled          = false
01:31:30.136 STDOUT [storage] terraform:       + table_encryption_key_type          = "Service"
01:31:30.136 STDOUT [storage] terraform:       + tags                               = {
01:31:30.136 STDOUT [storage] terraform:           + "costCenter"  = "development"
01:31:30.136 STDOUT [storage] terraform:           + "environment" = "dev"
01:31:30.136 STDOUT [storage] terraform:           + "managedBy"   = "Terragrunt"
01:31:30.136 STDOUT [storage] terraform:           + "org"         = "chf"
01:31:30.136 STDOUT [storage] terraform:           + "project"     = "ChaufHER"
01:31:30.136 STDOUT [storage] terraform:         }
01:31:30.136 STDOUT [storage] terraform:       + blob_properties {
01:31:30.136 STDOUT [storage] terraform:           + change_feed_enabled      = false
01:31:30.136 STDOUT [storage] terraform:           + default_service_version  = (known after apply)
01:31:30.136 STDOUT [storage] terraform:           + last_access_time_enabled = false
01:31:30.136 STDOUT [storage] terraform:           + versioning_enabled       = false
01:31:30.137 STDOUT [storage] terraform:           + container_delete_retention_policy {
01:31:30.137 STDOUT [storage] terraform:               + days = 7
01:31:30.137 STDOUT [storage] terraform:             }
01:31:30.137 STDOUT [storage] terraform:           + delete_retention_policy {
01:31:30.137 STDOUT [storage] terraform:               + days                     = 7
01:31:30.137 STDOUT [storage] terraform:               + permanent_delete_enabled = false
01:31:30.137 STDOUT [storage] terraform:             }
01:31:30.137 STDOUT [storage] terraform:         }
01:31:30.137 STDOUT [storage] terraform:       + network_rules {
01:31:30.137 STDOUT [storage] terraform:           + bypass                     = [
01:31:30.137 STDOUT [storage] terraform:               + "AzureServices",
01:31:30.137 STDOUT [storage] terraform:               + "Logging",
01:31:30.137 STDOUT [storage] terraform:               + "Metrics",
01:31:30.137 STDOUT [storage] terraform:             ]
01:31:30.137 STDOUT [storage] terraform:           + default_action             = "Deny"
01:31:30.137 STDOUT [storage] terraform:           + ip_rules                   = (known after apply)
01:31:30.137 STDOUT [storage] terraform:           + virtual_network_subnet_ids = (known after apply)
01:31:30.137 STDOUT [storage] terraform:         }
01:31:30.137 STDOUT [storage] terraform:       + queue_properties {
01:31:30.137 STDOUT [storage] terraform:           + hour_metrics (known after apply)
01:31:30.138 STDOUT [storage] terraform:           + logging {
01:31:30.138 STDOUT [storage] terraform:               + delete                = true
01:31:30.138 STDOUT [storage] terraform:               + read                  = true
01:31:30.138 STDOUT [storage] terraform:               + retention_policy_days = 30
01:31:30.138 STDOUT [storage] terraform:               + version               = "1.0"
01:31:30.138 STDOUT [storage] terraform:               + write                 = true
01:31:30.138 STDOUT [storage] terraform:             }
01:31:30.138 STDOUT [storage] terraform:           + minute_metrics (known after apply)
01:31:30.138 STDOUT [storage] terraform:         }
01:31:30.138 STDOUT [storage] terraform:       + routing (known after apply)
01:31:30.138 STDOUT [storage] terraform:       + sas_policy {
01:31:30.138 STDOUT [storage] terraform:           + expiration_action = "Log"
01:31:30.138 STDOUT [storage] terraform:           + expiration_period = "00.01:00:00"
01:31:30.138 STDOUT [storage] terraform:         }
01:31:30.138 STDOUT [storage] terraform:       + share_properties (known after apply)
01:31:30.138 STDOUT [storage] terraform:       + static_website (known after apply)
01:31:30.138 STDOUT [storage] terraform:     }
01:31:30.138 STDOUT [storage] terraform:   # azurerm_storage_container.documents will be created
01:31:30.138 STDOUT [storage] terraform:   + resource "azurerm_storage_container" "documents" {
01:31:30.139 STDOUT [storage] terraform:       + container_access_type             = "private"
01:31:30.139 STDOUT [storage] terraform:       + default_encryption_scope          = (known after apply)
01:31:30.139 STDOUT [storage] terraform:       + encryption_scope_override_enabled = true
01:31:30.139 STDOUT [storage] terraform:       + has_immutability_policy           = (known after apply)
01:31:30.139 STDOUT [storage] terraform:       + has_legal_hold                    = (known after apply)
01:31:30.139 STDOUT [storage] terraform:       + id                                = (known after apply)
01:31:30.139 STDOUT [storage] terraform:       + metadata                          = (known after apply)
01:31:30.139 STDOUT [storage] terraform:       + name                              = "documents"
01:31:30.139 STDOUT [storage] terraform:       + resource_manager_id               = (known after apply)
01:31:30.139 STDOUT [storage] terraform:       + storage_account_id                = (known after apply)
01:31:30.139 STDOUT [storage] terraform:     }
01:31:30.139 STDOUT [storage] terraform:   # azurerm_storage_container.profiles will be created
01:31:30.140 STDOUT [storage] terraform:   + resource "azurerm_storage_container" "profiles" {
01:31:30.140 STDOUT [storage] terraform:       + container_access_type             = "private"
01:31:30.140 STDOUT [storage] terraform:       + default_encryption_scope          = (known after apply)
01:31:30.140 STDOUT [storage] terraform:       + encryption_scope_override_enabled = true
01:31:30.140 STDOUT [storage] terraform:       + has_immutability_policy           = (known after apply)
01:31:30.140 STDOUT [storage] terraform:       + has_legal_hold                    = (known after apply)
01:31:30.140 STDOUT [storage] terraform:       + id                                = (known after apply)
01:31:30.140 STDOUT [storage] terraform:       + metadata                          = (known after apply)
01:31:30.140 STDOUT [storage] terraform:       + name                              = "profiles"
01:31:30.140 STDOUT [storage] terraform:       + resource_manager_id               = (known after apply)
01:31:30.140 STDOUT [storage] terraform:       + storage_account_id                = (known after apply)
01:31:30.140 STDOUT [storage] terraform:     }
01:31:30.140 STDOUT [storage] terraform:   # azurerm_storage_container.trips will be created
01:31:30.141 STDOUT [storage] terraform:   + resource "azurerm_storage_container" "trips" {
01:31:30.141 STDOUT [storage] terraform:       + container_access_type             = "private"
01:31:30.141 STDOUT [storage] terraform:       + default_encryption_scope          = (known after apply)
01:31:30.141 STDOUT [storage] terraform:       + encryption_scope_override_enabled = true
01:31:30.141 STDOUT [storage] terraform:       + has_immutability_policy           = (known after apply)
01:31:30.141 STDOUT [storage] terraform:       + has_legal_hold                    = (known after apply)
01:31:30.141 STDOUT [storage] terraform:       + id                                = (known after apply)
01:31:30.141 STDOUT [storage] terraform:       + metadata                          = (known after apply)
01:31:30.141 STDOUT [storage] terraform:       + name                              = "trips"
01:31:30.141 STDOUT [storage] terraform:       + resource_manager_id               = (known after apply)
01:31:30.141 STDOUT [storage] terraform:       + storage_account_id                = (known after apply)
01:31:30.141 STDOUT [storage] terraform:     }
01:31:30.141 STDOUT [storage] terraform: Plan: 4 to add, 0 to change, 0 to destroy.
01:31:30.142 STDOUT [storage] terraform: Changes to Outputs:
01:31:30.142 STDOUT [storage] terraform:   + documents_container_name  = "documents"
01:31:30.142 STDOUT [storage] terraform:   + primary_access_key        = (sensitive value)
01:31:30.142 STDOUT [storage] terraform:   + primary_blob_endpoint     = (known after apply)
01:31:30.142 STDOUT [storage] terraform:   + primary_connection_string = (sensitive value)
01:31:30.142 STDOUT [storage] terraform:   + profiles_container_name   = "profiles"
01:31:30.142 STDOUT [storage] terraform:   + storage_account_id        = (known after apply)
01:31:30.142 STDOUT [storage] terraform:   + storage_account_name      = "chfdevstordev"
01:31:30.142 STDOUT [storage] terraform:   + trips_container_name      = "trips"
01:31:30.142 STDOUT [storage] terraform: Warning: Argument is deprecated
01:31:30.142 STDOUT [storage] terraform:   with azurerm_storage_account.main,
01:31:30.142 STDOUT [storage] terraform:   on main.tf line 16, in resource "azurerm_storage_account" "main":
01:31:30.142 STDOUT [storage] terraform:   16: resource "azurerm_storage_account" "main" {
01:31:30.142 STDOUT [storage] terraform: this block has been deprecated and superseded by the
01:31:30.142 STDOUT [storage] terraform: `azurerm_storage_account_queue_properties` resource and will be removed in
01:31:30.142 STDOUT [storage] terraform: v5.0 of the AzureRM provider
01:31:30.142 STDOUT [storage] terraform: ─────────────────────────────────────────────────────────────────────────────
01:31:30.143 STDOUT [storage] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
01:31:30.143 STDOUT [storage] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
01:31:30.468 STDOUT [static-web-app-docs] terraform: Terraform used the selected providers to generate the following execution
01:31:30.468 STDOUT [static-web-app-docs] terraform: plan. Resource actions are indicated with the following symbols:
01:31:30.468 STDOUT [static-web-app-docs] terraform:   + create
01:31:30.468 STDOUT [static-web-app-docs] terraform: Terraform will perform the following actions:
01:31:30.468 STDOUT [static-web-app-docs] terraform:   # azurerm_static_web_app.main will be created
01:31:30.468 STDOUT [static-web-app-docs] terraform:   + resource "azurerm_static_web_app" "main" {
01:31:30.468 STDOUT [static-web-app-docs] terraform:       + api_key                            = (sensitive value)
01:31:30.468 STDOUT [static-web-app-docs] terraform:       + configuration_file_changes_enabled = true
01:31:30.468 STDOUT [static-web-app-docs] terraform:       + default_host_name                  = (known after apply)
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + id                                 = (known after apply)
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + location                           = "southafricanorth"
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + name                               = "chf-dev-docs-swa"
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + preview_environments_enabled       = true
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + public_network_access_enabled      = true
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + resource_group_name                = "rg-mock"
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + sku_size                           = "Free"
01:31:30.469 STDOUT [static-web-app-docs] terraform:       + sku_tier                           = "Free"
01:31:30.471 STDOUT [static-web-app-docs] terraform:       + tags                               = {
01:31:30.471 STDOUT [static-web-app-docs] terraform:           + "costCenter"  = "development"
01:31:30.471 STDOUT [static-web-app-docs] terraform:           + "environment" = "dev"
01:31:30.472 STDOUT [static-web-app-docs] terraform:           + "managedBy"   = "Terragrunt"
01:31:30.472 STDOUT [static-web-app-docs] terraform:           + "org"         = "chf"
01:31:30.472 STDOUT [static-web-app-docs] terraform:           + "project"     = "ChaufHER"
01:31:30.472 STDOUT [static-web-app-docs] terraform:         }
01:31:30.472 STDOUT [static-web-app-docs] terraform:     }
01:31:30.472 STDOUT [static-web-app-docs] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
01:31:30.472 STDOUT [static-web-app-docs] terraform: Changes to Outputs:
01:31:30.472 STDOUT [static-web-app-docs] terraform:   + api_key           = (sensitive value)
01:31:30.472 STDOUT [static-web-app-docs] terraform:   + default_host_name = (known after apply)
01:31:30.472 STDOUT [static-web-app-docs] terraform:   + id                = (known after apply)
01:31:30.472 STDOUT [static-web-app-docs] terraform:   + name              = "chf-dev-docs-swa"
01:31:30.472 STDOUT [static-web-app-docs] terraform: ─────────────────────────────────────────────────────────────────────────────
01:31:30.472 STDOUT [static-web-app-docs] terraform: Note: Yo
```

</details>

<sub>Pusher: @Copilot | Workflow: `Infrastructure Validate` | [Actions](https://github.com/phoenixvc/chaufher/actions/runs/22595830638)</sub>